//接口返回错误码列表
let Error = {
  601:    "密码错误",
  602:    "数据库错误",
  603:    "请求参数错误",
  606:    "已发送，未超时3分钟",
  607:    "验证码已过期",
  608:    "验证码错误",
  609:    "操作类型错误",
  611:    "redis错误",
  612:    "密码输入错误次数过多，处于禁止输入时间内",
  613:    "未登录",
  614:    "未找到数据",
  615:    "没有数据",
  618:    "json转化错误",
  619:    "图形验证码错误",
  621:    "与登录密码相同",
  623:    "账号已被占用",
  626:    "用户被禁止登录",
  629:    "用户状态异常",
  631:    "登陆密码错误",

  // 公共错误
  0   :   "正确",
  1   :   "未知错误",
  2   :   "Action不可用",
  3   :   "服务暂时不可用",
  500 :   "业务逻辑错误从此开始",
  1001:   "连接被禁止",
  1002:   "连接时传入的Token不合法",

  // 验证相关
  2006:   "登录token已超时失效",
  2010:   "需要手机验证码",
  2011:   "验证方式不能为空",

  // 用户操作
  2800:   "当前交易对已收藏",
  2801:   "当前交易对未收藏",

};

export default function(ret){
  return Error[ret] || "未知错误";
}

